dejiraku_hotel/app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("name", "description", "price", "created_at", "updated_at") VALUES ('デラックスオーシャンビュー', '美しい海が見える最高の客室です。', 35000, '2026-01-12 11:04:53.421264', '2026-01-12 11:04:53.421264') RETURNING "id"

    def set_room
      @room = Room.find(params.expect(:id))
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1